app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    if params[:back]
      render :new
    else
      if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "okoko"], ["content", "kokoko"], ["created_at", "2020-09-07 14:52:38.076588"], ["updated_at", "2020-09-07 14:52:38.076588"]]

  def update
    if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "fw"], ["content", "op"], ["updated_at", "2020-09-07 13:39:23.678384"], ["id", 7]]

  def blog_select
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]